<a href="https://colab.research.google.com/github/selvasankar85/hello_world/blob/main/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import

In [2]:
import pandas as pd
data={'Name':['Arun','Bala','Cathy','David'],'Age':[23,28,25,30],'Salary':[30000,40000,35000,45000]}
df=pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   Arun   23   30000
1   Bala   28   40000
2  Cathy   25   35000
3  David   30   45000

In [4]:
print(df['Age'])

0    23
1    28
2    25
3    30
Name: Age, dtype: int64

In [5]:
print(df[['Age']])

   Age
0   23
1   28
2   25
3   30

In [6]:
selcomlumns=df[['Name','Salary']]
print(selcomlumns)

    Name  Salary
0   Arun   30000
1   Bala   40000
2  Cathy   35000
3  David   45000

In [7]:
firstrow=df.iloc[0]
print(firstrow)

Name       Arun
Age          23
Salary    30000
Name: 0, dtype: object

In [8]:
print(df.iloc[[0]])

   Name  Age  Salary
0  Arun   23   30000

In [9]:
print(df.head(3))

    Name  Age  Salary
0   Arun   23   30000
1   Bala   28   40000
2  Cathy   25   35000

In [10]:
csalary=df.iloc[2,2]
print(csalary)

35000

In [11]:
sdata=df[['Age','Salary']]
print(sdata)

   Age  Salary
0   23   30000
1   28   40000
2   25   35000
3   30   45000

In [12]:
df['Tax']=df['Salary']*0.05
print(df)

    Name  Age  Salary     Tax
0   Arun   23   30000  1500.0
1   Bala   28   40000  2000.0
2  Cathy   25   35000  1750.0
3  David   30   45000  2250.0

In [ ]:
dfnew=df.drop('Age',axis=1)
print(dfnew)